<?php

function t() {
	$a = date("H");
	$b = date("i");
	$h = ""; $i = "";

	if ( ($a % 100 > 10 && $a % 100 < 20) || 
			 ($a % 10 == 0) || 
			 ($a % 10 >= 5 && $a % 10 <= 9) ) {
					$h = " часов";
	} elseif ($a % 10 == 1) {
					$h = " час";
	} elseif ($a % 10 >= 2 && $a % 10 <= 4 ) {
					$h = " часа";
	};
	if ( ($b % 100 > 10 && $b % 100 < 20) || 
			 ($b % 10 == 0) ||
			 ($b % 10 >= 5 && $b % 10 <= 9) ) {
					$i = " минут";
	} elseif ($b % 10 == 1) {
					$i = " минута";
	} elseif ($b % 10 >= 2 && $b % 10 <= 4 ) {
					$i = " минуты";
	};
	echo "Сейчас ".$a.$h." ".$b.$i ;
};

t();